# Tessellate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..Tessellate Method
Curve Class See Also
---
Valid only if the curve is bound. Returns a polyline approximation to the curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<XYZ> Tessellate()
```

Visual Basic
---
```text
Public Function Tessellate As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ Tessellate()
```

# Remarks
Tolerance of approximation is defined internally by Revit to be adequate for display purposes.
# See Also
Curve Class
Autodesk.Revit.DB Namespace